OpenFOAM/WFD_OpenFOAM/templates/prop_MRF_template/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

propellerForces
{
    type            forces;
    libs            ("libforces.so");

    writeControl    timeStep;
    writeInterval   1;
    log             yes;

    patches         (propeller);

    rho             rhoInf;
    rhoInf          1.225;
    CofR            (0 0 0);
    pitchAxis       (0 0 1);
}

// ************************************************************************* //
